Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/case_studies/case_study_redundancy_payment_and_short_time_working.html.txt.tmx
Source language: en
Languages: ga

source: Case study: Redundancy payment and short-time working
ga: Cás-Staidéar ar íocaíocht iomarcaíochta agus obair ghearr-ama

source: Mary has worked for the same employer for the past 15 years
ga: D'oibrigh Mary don fhostóir céanna le 15 bliana anuas

source: Two years ago she was put on a three-day week on the understanding that this was temporary and that full-time work would be resumed
ga: Cuireadh ar sheachtain trí lá í dhá bhliain ó shin ar an tuiscint go mbeadh obair lánaimseartha atosaithe

source: She has now been told however that she is to be made redundant
ga: Cibé ar bith, tá sé ráite léi anois go ndéanfar iomarcach í

source: Over the years she has never received a pay increase
ga: Le linn na mblianta, ní bhfuair sí ardú pá riamh

source: How will her redundancy payment be calculated?
ga: Cén chaoi a ndéanfar a híocaíocht a mheas?

source: Mary would be entitled to two weeks' pay for each year of service plus one extra week's pay
ga: Bheadh Mary i dteideal dhá sheachtain phá do gach bliain seirbhíse móide seachtain phá sa bhreis

source: The present ceiling (since 1 January 2005) on earnings is €600 per week (previously €507 per week)
ga: Is é an t-uasteorainn reatha (ó 1 Eanáir 2005) ar thuillimh ná €600 in aghaidh na seachtaine ( €507 in aghaidh na seachtaine roimhe sin)

source: The payment would normally be calculated on her earnings at the time she is let go
ga: Bheadh an íocaíocht ríofa go hiondúil bunaithe ar a tuillimh nuair a dhéanadh í a dhífhostú

source: She had been working full-time for 13 years however before being put on reduced working hours
ga: Cibé ar bith, bhí sí ag obair lánaimseartha ar feadh 13 bliana roimh ar cuireadh ar uaireanta oibre laghdaithe í

source: That is, a three-day week
ga: 'Sé sin, seachtain trí lá

source: If she was made redundant within one year of being put on reduced hours, her redundancy payment would be based on her earnings for a full week
ga: Más rud é go ndearnadh iomarcach í laistigh de bhliain amháin ó bheith curtha ar uaireanta laghdaithe, bheadh a híocaíocht iomarcaíochta bunaithe ar a cuid tuillimh do sheachtain iomlán

source: In this case she is being made redundant having been on a three-day week for more than a year
ga: Sa chás seo, tá sí á déanamh iomarcach tar éis a bheith ar sheachtain trí lá níos faide ná bliain

source: How her payment will be calculated depends on whether she accepted being on reduced hours or not
ga: Tá an bealach ina measfar a híocaíocht ag brath ar cibé ar ghlac nó nár ghlac sí le bheith ar na huaireanta laghdaithe

source: If she fully accepted the reduced working hours as her normal week and never asked to return to full-time work, then her redundancy payment will be based on her gross pay for the reduced working hours
ga: Má ghlac sí go hiomlán lena huaireanta oibre laghdaithe mar ghnáthsheachtain agus nár iarr sí riamh filleadh ar obair lánaimseartha, beidh a híocaíocht iomarcaíochta mar sin bunaithe ar a ollphá do na huaireanta oibre laghdaithe

source: If, on the other hand, she never accepted the reduced working hours as her normal hours and continually asked to be put back on full-time working, then it is clear she did not accept her reduced working hours as normal
ga: Ar an láimh eile, murar ghlac sí riamh leis na huaireanta oibre laghdaithe mar a gnáth uaireanta agus gur iarr sí go leanúnach a bheith curtha ar ais ag obair go lánaimseartha, tá sé soiléir mar sin nár ghlac sí leis na huaireanta oibre laghdaithe mar a gnáthuaireanta

source: In this situation, her redundancy payment should be calculated based on her full-time rate of pay
ga: Sa chás seo, ba chóir go mbeadh a híocaíocht iomarcaíochta ríofa, bunaithe ar a ráta lánaimseartha pá

source: If she had asked to be placed on reduced working hours for her own reasons and the employer agreed, then the redundancy entitlement would based on the reduced hours
ga: Más rud é go ndearna sí iarratas a bheith curtha ar uaireanta oibre laghdaithe agus gur aontaigh an fostóir leis, beidh an teidlíocht iomarcaíochta bunaithe ar na huaireanta laghdaithe mar sin

source: If she has a dispute about this with her employer she could make a claim to the Workplace Relations Commission using the online complaint form available on workplacerelations.ie
ga: Má tá aighneas aici faoin méid seo lena fostóir is féidir léi éileamh a dhéanamh ar an gCoimisiún um Chaidreamh san Áit Oibre tríd an fhoirm ghearáin ar líne nua a úsáid á fáil ar workplacerelations.ie
